INSERT INTO public.authors
(author_id, author_name)
VALUES
(1, 'Пушкин Александр Сергеевич'),
(2, 'Лермонтов Михаил Юрьевич'),
(3, 'Чехов Антон Павлович'),
(4, 'Достоевский Федор Михалович'),
(5, 'Грибоедов Александр Сергеевич');

INSERT INTO public.publish_houses
(publ_house_id, house_name, city)
VALUES
(1, 'Дрофа', 'Москва'),
(2, 'Феникс', 'Ростов-на-Дону'),
(3, 'Просвещение', 'Москва');

INSERT INTO public.books
(book_id, title, author_id, public_year, amount_pages, price, amount, publ_house_id)
VALUES
(1, 'Евгений Онегин', 1, 1997, 260, 199.70, 7, 1),
(2, 'Палата № 6', 3, 2000, 74, 75.99, 2, 3),
(3, 'Преступление и наказание', 4, 1977, 412, 399.99, 3, 2),
(4, 'Мцыри', 2, 1989, 210, 127.99, 1, 1),
(5, 'Недоросль', 5, 1990, 120, 229.00, 4, 3);
